app/controllers/maps_controller.rb

SELECT `attachments`.* FROM `attachments` WHERE `attachments`.`map_id` IN (1)
SELECT `maps`.* FROM `maps` WHERE `maps`.`id` = 1 LIMIT 1
SELECT `users`.*, `t0`.`map_id` AS ar_association_key_name FROM `users` INNER JOIN `maps_users` `t0` ON `users`.`id` = `t0`.`user_id` WHERE `t0`.`map_id` IN (1)
---
  def show
    @container_class = 'container-fluid'
    @map = Map.find(params[:id], :include => [:attachments, :users])

SELECT `maps`.* FROM `maps` WHERE `maps`.`id` = 1 LIMIT 1
---
  def edit
    @container_class = 'container-fluid'
    @map = Map.find(params[:id])

INSERT INTO `maps` (`conf`, `content`, `created_at`, `isPublic`, `last_edit_by`, `svgdata`, `title`, `updated_at`, `user_id`) VALUES ('mindmap', '{\"nodes\":[{\"position\":{\"x\":4000,\"y\":3000},\"size\":{\"w\":100,\"h\":60},\"text\":\"New map\",\"radius\":10,\"style\":\"OpenMindMap.node.classic\",\"isroot\":true}],\"connections\":{},\"images\":[]}', '2013-04-27 10:13:21', NULL, NULL, '<?xml version=\"1.0\"?>\n', NULL, '2013-04-27 10:13:21', 1)
---
  def create
    unless ['dialoguemap', 'mindmap'].include?(params[:map][:conf])
      redirect_to :action => :new, :notice => 'There is a problem with the new map'
    end


    @map = Map.new(params[:map])
    case params[:map][:conf]
      when 'dialoguemap' then @map.content = '{"nodes":[{"position":{"x":50,"y":324},"size":{"w":100,"h":60},"text":"New map","radius":10,"style":"OpenMindMap.node.ibis.question","isroot":true}],"connections":{},"images":[]}'
      when 'mindmap' then @map.content = '{"nodes":[{"position":{"x":4000,"y":3000},"size":{"w":100,"h":60},"text":"New map","radius":10,"style":"OpenMindMap.node.classic","isroot":true}],"connections":{},"images":[]}'
    end
    @map.user = current_user

    respond_to do |format|
      if @map.save

SELECT `maps`.* FROM `maps` WHERE `maps`.`id` = 1 LIMIT 1
---
  def update
    @map = Map.find(params[:id])